cosc561/copt/writeup.tex
\subsubsection{\texttt{copt\_O0}}
\label{sec:org622eb9e}
\begin{verbatim}
jmowry4:hydra4 ~/copt> bash test.sh copt_O0                                                                                                                                                                                      <-  7:02AM
Running MATRIX_INIT with n = 3000 loop = 200

UNOPTIMIZED(ms):       16216.0
OPTIMIZED(ms):          1467.0
SPEEDUP:                  11.1

Running ARRAY_INIT with n = 300000 loop = 20000

UNOPTIMIZED(ms):       20983.0
OPTIMIZED(ms):          4100.0
SPEEDUP:                   5.1

Running FACTORIAL with n = 20 loop = 200000000

UNOPTIMIZED(ms):       24600.0
OPTIMIZED(ms):          3766.0
SPEEDUP:                   6.5

Running MATRIX_MULTIPLY with n = 1600 loop = 1

UNOPTIMIZED(ms):       31700.0
OPTIMIZED(ms):         10617.0
SPEEDUP:                   3.0
\end{verbatim}
\subsubsection{\texttt{copt\_O0\_ref}}
\label{sec:org9465cae}
\begin{verbatim}
jmowry4:hydra4 ~/copt> bash test.sh copt_O0_ref                                                                                        <-  5:50PM
Running MATRIX_INIT with n = 3000 loop = 200

UNOPTIMIZED(ms):       16216.0
OPTIMIZED(ms):          6117.0
SPEEDUP:                  2.65

Running ARRAY_INIT with n = 300000 loop = 20000

UNOPTIMIZED(ms):       20966.0
OPTIMIZED(ms):          6200.0
SPEEDUP:                  3.38

Running FACTORIAL with n = 20 loop = 200000000

UNOPTIMIZED(ms):       23533.0
OPTIMIZED(ms):         10083.0
SPEEDUP:                  2.33

Running MATRIX_MULTIPLY with n = 1600 loop = 1

UNOPTIMIZED(ms):       32967.0
OPTIMIZED(ms):         21384.0
SPEEDUP:                  1.54
\end{verbatim}
\subsection{\texttt{-O3}}
\label{sec:orgf61d773}
As I expected, turning optimizations up to \texttt{-O3} negates the performance benefits from my optimized solutions. This is because my optimizations have likely made the compilers job harder, as it can no longer work with straight forward, easy to analyze loops.\\

It appears that the reference solution observes some of the same pitfalls as my optimizations, only deviating on array initialization and matrix multiplication. My array initialization code manually unrolled a loop 16 times, which likely hindered the compilers' ability to optimize this section of code. My matrix multiplication code did not use common optimizations like chunking, thereby making little to no difference in the generated assembly when optimizations were enabled.\\
\subsubsection{\texttt{copt\_O3}}
\label{sec:org0fc354f}
\begin{verbatim}
jmowry4:hydra4 ~/copt> bash test.sh copt_O3                                                                                                                                                                                      <-  7:03AM
Running MATRIX_INIT with n = 3000 loop = 200

UNOPTIMIZED(ms):        1516.0
OPTIMIZED(ms):          1517.0
SPEEDUP:                   1.0

Running ARRAY_INIT with n = 300000 loop = 20000

UNOPTIMIZED(ms):         933.0
OPTIMIZED(ms):          3983.0
SPEEDUP:                   0.2

Running FACTORIAL with n = 20 loop = 200000000

UNOPTIMIZED(ms):        2050.0
OPTIMIZED(ms):          2016.0
SPEEDUP:                   1.0

Running MATRIX_MULTIPLY with n = 1600 loop = 1

UNOPTIMIZED(ms):        7150.0
OPTIMIZED(ms):          7183.0
SPEEDUP:                   1.0
\end{verbatim}
\subsubsection{\texttt{copt\_O3\_ref}}
\label{sec:org3866dd4}
\begin{verbatim}
jmowry4:hydra4 ~/copt> bash test.sh copt_O3_ref                                                                                                                                                                                                                                        <-  5:53PM
Running MATRIX_INIT with n = 3000 loop = 200

UNOPTIMIZED(ms):        1550.0
OPTIMIZED(ms):          1517.0
SPEEDUP:                  1.02

Running ARRAY_INIT with n = 300000 loop = 20000

UNOPTIMIZED(ms):         933.0
OPTIMIZED(ms):          1700.0
SPEEDUP:                  0.55

Running FACTORIAL with n = 20 loop = 200000000

UNOPTIMIZED(ms):        1966.0
OPTIMIZED(ms):          1917.0
SPEEDUP:                  1.03

Running MATRIX_MULTIPLY with n = 1600 loop = 1

UNOPTIMIZED(ms):        7216.0
OPTIMIZED(ms):          1617.0
SPEEDUP:                  4.46
\end{verbatim}
\subsection{What Optimizations are Effective and Where?}
\label{sec:org624fc4f}
In general the most effective optimization (when compiling with \texttt{-O0}) is the use of the \texttt{register} keyword. When the compiler generates unoptimized code it typically stores local variables on the stack, which leads to unnecessary load/store instruction. If we instead instruct the compiler to leave these local variables in registers we can achieve a large speed-up. However, this optimization is far less effective under some real-world conditions. One example is a subroutine that uses a large number local variables, which would cause the compiler to ``spill'' our \texttt{register} values onto the stack. Another situation where \texttt{register} would not be helpful is when compiling with higher levels of optimization, as the compiler is able to apply this transformation automatically. The use of \texttt{register} helps when local variables are accessed frequently, such as arithmetic accumulators, or loop iterators.\\

The next key optimization is to remove naive uses of arithmetic operators, and fold in compile-time known constants. When compiling with optimizations the compiler can generate the optimal sequence of instructions for code of the form \texttt{x = y * 8}. However, without optimizations the compiler will sometimes choose to use an \texttt{imul} instruction directly. On 10th generation Intel CPU we can execute at most 1 \texttt{imul} instruction per cycle, whereas up to 2 \texttt{shl} instructions can execute per cycle (assuming our operands are of type register, and immediate, as they are in this example). Having said that, the optimal assembly sequence is neither an \texttt{imul} nor a \texttt{shl}, it would instead be a \texttt{lea} instruction. Unlike \texttt{imul} and \texttt{shl}, \texttt{lea} execute on multiple ports, allowing for more ILP, while maintaining the ability to execute 2 independent computations in the same cycle.\\

Lastly, the most complex optimization that I performed is loop unrolling, and transforming recursive functions into loops. This is a more complex optimization as it requires ``bookkeeping'' to ensure the results are consistent with the non-unrolled version. Loop unrolling is a common optimization that compilers will make when using higher levels of optimization, so performing it manually at \texttt{-O0} is a good choice. At a high level this optimization allows the CPU to execute more instructions at once by keeping the pipeline full, and reducing the total number of branch instructions.\\
\subsection{Why Does \texttt{-O3} Hurt Some Optimizations?}
\label{sec:orgbacac2e}
My array initialization optimization was the only one hurt by enabling \texttt{-O3} optimizations, and I believe this comes down to the manual loop unrolling. My manually unrolled loop generates a complex assembly routine, totaling \textasciitilde{}400 instructions. The naive implementation generates a sequence of only \textasciitilde{}40 instructions, with the compiler only choosing to unroll the loop 2 times, while using a vectorization width of 4, resulting in 8 indices processed per loop iteration.\\

While large unroll widths can be helpful, they can also hurt performance as they generate more instructions, placing more pressure on the L1i cache, and potentially the CPU's own μop cache.\\
