cosc561/copt/writeup.org
** What Optimizations Are Unaffected or Benefited by =-O3=?
One optimization that is unaffected by =-O3= is the use of =register=, which makes sense as the compiler is more than smart enough to automatically mark local variables as =register= without the explicit direction of the programmer.

Another optimization would be the transformation from a recursive function into an iterative loop, such as the factorial subroutine. Looking at the generated assembly for the unoptimized version compiled with =-O3= we see that the compiler correctly identified that it could transform this tail recursive function into an iterative one.

None of my own optimizations benefited from switching to =-O3=. The only optimization that I expected to benefit from =-O3= was the reordering of loops in the matrix multiplication, however this did not turn out to be the case. Looking at the assembly generated it turns out that the compiler was able to make the optimization for us, thereby negating any benefit from my manual reordering.

#  LocalWords:  memoization unoptimized memoizing prefetch prefetching ILP μop
#  LocalWords:  hacky L1i
