cosc561/copt/writeup.tex
\subsection{What Optimizations Are Unaffected or Benefited by \texttt{-O3}?}
\label{sec:org8b8c248}
One optimization that is unaffected by \texttt{-O3} is the use of \texttt{register}, which makes sense as the compiler is more than smart enough to automatically mark local variables as \texttt{register} without the explicit direction of the programmer.\\

Another optimization would be the transformation from a recursive function into an iterative loop, such as the factorial subroutine. Looking at the generated assembly for the unoptimized version compiled with \texttt{-O3} we see that the compiler correctly identified that it could transform this tail recursive function into an iterative one.\\

None of my own optimizations benefited from switching to \texttt{-O3}. The only optimization that I expected to benefit from \texttt{-O3} was the reordering of loops in the matrix multiplication, however this did not turn out to be the case. Looking at the assembly generated it turns out that the compiler was able to make the optimization for us, thereby negating any benefit from my manual reordering.\\
\end{document}
